# Pandas数据规整 - 合并

---

数据合并

Pandas提供了大量方法，能轻松的对Series，DataFrame执行合并操作

* 按行合并
    * 追加：append()
    * 连接：concat()  # 行列均可
* 按列合并
    * 复杂合并：merge()
        * 按行索引合并：join()
* 合并重叠数据(一个表为主，先填充再合并)：combine_first()

In [1]:
import numpy as np
import pandas as pd

追加 append()
---

一个表追加到另一个后面

In [2]:
s = pd.Series([0, 1], index=['a', 'c'])
s1 = pd.Series([2, 3, 4], index=['b', 'd', 'e'])
s

a    0
c    1
dtype: int64

In [3]:
s1

b    2
d    3
e    4
dtype: int64

In [4]:
s.append(s1)

a    0
c    1
b    2
d    3
e    4
dtype: int64

In [5]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A','B','C','D'])
df

          A         B         C         D
0 -0.683790  0.006203 -0.731096  0.527782
1 -1.088364  1.345909 -1.490373 -0.030055
2 -1.669648  1.181420  0.403641 -0.162417
3 -0.799786 -1.369861 -0.338990  0.009644
4 -0.316752 -0.167688 -1.304656 -0.574638
5  0.696083  0.688665  0.611551 -0.107379
6  1.756597  1.674432  0.545048  1.146414
7  1.210856 -0.492450 -1.031373  1.236810

In [6]:
s = df.loc[[3, 5]]
s

          A         B         C         D
3 -0.799786 -1.369861 -0.338990  0.009644
5  0.696083  0.688665  0.611551 -0.107379

In [8]:
# 追加合并
df.append(s)
df.append(s, ignore_index=True)  # 不使用追加表的索引,使用主表的默认索引

          A         B         C         D
0 -0.683790  0.006203 -0.731096  0.527782
1 -1.088364  1.345909 -1.490373 -0.030055
2 -1.669648  1.181420  0.403641 -0.162417
3 -0.799786 -1.369861 -0.338990  0.009644
4 -0.316752 -0.167688 -1.304656 -0.574638
5  0.696083  0.688665  0.611551 -0.107379
6  1.756597  1.674432  0.545048  1.146414
7  1.210856 -0.492450 -1.031373  1.236810
8 -0.799786 -1.369861 -0.338990  0.009644
9  0.696083  0.688665  0.611551 -0.107379

DataFrame和Series追加合并

In [9]:
df

          A         B         C         D
0 -0.683790  0.006203 -0.731096  0.527782
1 -1.088364  1.345909 -1.490373 -0.030055
2 -1.669648  1.181420  0.403641 -0.162417
3 -0.799786 -1.369861 -0.338990  0.009644
4 -0.316752 -0.167688 -1.304656 -0.574638
5  0.696083  0.688665  0.611551 -0.107379
6  1.756597  1.674432  0.545048  1.146414
7  1.210856 -0.492450 -1.031373  1.236810

In [10]:
s2 = pd.Series([1,2,3,4], index = ['A','B','C','D'])
s2

A    1
B    2
C    3
D    4
dtype: int64

In [11]:
df.append(s2, ignore_index=True)

          A         B         C         D
0 -0.683790  0.006203 -0.731096  0.527782
1 -1.088364  1.345909 -1.490373 -0.030055
2 -1.669648  1.181420  0.403641 -0.162417
3 -0.799786 -1.369861 -0.338990  0.009644
4 -0.316752 -0.167688 -1.304656 -0.574638
5  0.696083  0.688665  0.611551 -0.107379
6  1.756597  1.674432  0.545048  1.146414
7  1.210856 -0.492450 -1.031373  1.236810
8  1.000000  2.000000  3.000000  4.000000

连接 .concat()
---

多个表按行或列合并

In [12]:
s1 = pd.Series([0, 1], index=['a', 'c'])
s2 = pd.Series([2, 3, 4], index=['b', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [13]:
s1

a    0
c    1
dtype: int64

In [14]:
s2

b    2
d    3
e    4
dtype: int64

In [15]:
s3

f    5
g    6
dtype: int64

In [16]:
pd.concat([s1, s2, s3])

a    0
c    1
b    2
d    3
e    4
f    5
g    6
dtype: int64

In [20]:
pd.concat([s1, s2, s3], axis=1, sort=False)  # sort参数，控制是否排序

     0    1    2
a  0.0  NaN  NaN
c  1.0  NaN  NaN
b  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [21]:
# 将 s1 和 s3 沿 0轴 连接创建 s4，这样 s4 和 s1 的 index 是有重复的。
s4 = pd.concat([s1, s3])
s4

a    0
c    1
f    5
g    6
dtype: int64

In [22]:
s1

a    0
c    1
dtype: int64

In [27]:
# 将 s1 和 s4 沿 1轴 内连接 (即只连接它们共有 index 对应的值)
pd.concat([s1, s4], axis=1, join='outer', sort=False)  # 默认outer
pd.concat([s1, s4], axis=1, sort=False, join='inner')

   0  1
a  0  0
c  1  1

In [29]:
# 还可以将 n 个 Series 沿 0轴 连接起来，再赋予 3 个 keys 创建多层 Series。
pd.concat([s1, s2, s3])
pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])

one    a    0
       c    1
two    b    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [30]:
x = df.loc[:2]
x

y = df.loc[4:6]
y

z = df[-2:]
z

          A         B         C         D
6  1.756597  1.674432  0.545048  1.146414
7  1.210856 -0.492450 -1.031373  1.236810

In [31]:
pd.concat([x, y, z])  # 将合并表格放入列表

          A         B         C         D
0 -0.683790  0.006203 -0.731096  0.527782
1 -1.088364  1.345909 -1.490373 -0.030055
2 -1.669648  1.181420  0.403641 -0.162417
4 -0.316752 -0.167688 -1.304656 -0.574638
5  0.696083  0.688665  0.611551 -0.107379
6  1.756597  1.674432  0.545048  1.146414
6  1.756597  1.674432  0.545048  1.146414
7  1.210856 -0.492450 -1.031373  1.236810

复杂合并 .merge()和.join()
---

按列合并

merge()函数用于复杂综合数据合并,操作复杂，功能强大

join()是merge()的一个特殊用法，用于按索引合并，操作简单，功能单一

In [32]:
# df1，姓名和分组
df1 = pd.DataFrame({
    'name': ['张三', '李四', '王五', '赵六'],
    'group': ['DBA', 'PM','PM', 'HR']
})
df1

  name group
0   张三   DBA
1   李四    PM
2   王五    PM
3   赵六    HR

In [33]:
# df2，姓名和入职时间
df2 = pd.DataFrame({
    'name': ['李四', '赵六', '张三', '王五'],
    'date': [2004, 2008, 2012, 2014]
})
df2

  name  date
0   李四  2004
1   赵六  2008
2   张三  2012
3   王五  2014

两个表必须有相关性，才有合并的需要

以两个表相关的列（或行索引）为基准，合并

方法1：使用查询和添加列进行表合并

比较麻烦，且行列如不完全对应容易出问题

In [40]:
# 查询添加默认以行索引为基准对齐，所以需要把俩表相关列设为行索引
df11 = df1.set_index('name').copy()
df21 = df2.set_index('name').copy()

df11
df21

      date
name
李四    2004
赵六    2008
张三    2012
王五    2014

In [42]:
df21['group'] = df11['group']
df21

df21.reset_index()

  name  date group
0   李四  2004    PM
1   赵六  2008    HR
2   张三  2012   DBA
3   王五  2014    PM

合并两个对象，默认匹配相同过的列名，自动对齐合并

In [43]:
df3 = pd.merge(df1, df2)
df3

  name group  date
0   张三   DBA  2012
1   李四    PM  2004
2   王五    PM  2014
3   赵六    HR  2008

要合并的样本量（行数）不同时，合并后的数据会自动扩展，不损失信息

In [44]:
df3

  name group  date
0   张三   DBA  2012
1   李四    PM  2004
2   王五    PM  2014
3   赵六    HR  2008

In [45]:
# df4，每个分组的领导，行数少
df4 = pd.DataFrame({
    'group': ['DBA', 'PM', 'HR'],
    'leader': ['钱大', '孙二', '周三']
})
df4

  group leader
0   DBA     钱大
1    PM     孙二
2    HR     周三

In [46]:
# 样本量（行数）不同时，合并后的数据会自动扩展，不损失信息
pd.merge(df3, df4)

  name group  date leader
0   张三   DBA  2012     钱大
1   李四    PM  2004     孙二
2   王五    PM  2014     孙二
3   赵六    HR  2008     周三

group分组和skills技能，行数多

In [47]:
df1

  name group
0   张三   DBA
1   李四    PM
2   王五    PM
3   赵六    HR

In [48]:
df5 = pd.DataFrame({
    'group': ['DBA', 'DBA','PM', 'PM', 'HR', 'HR'],
    'skills': ['Linux', '数据库', 'Axuer RP', '社交','招聘', '组织']
})
df5

  group    skills
0   DBA     Linux
1   DBA       数据库
2    PM  Axuer RP
3    PM        社交
4    HR        招聘
5    HR        组织

In [49]:
pd.merge(df1, df5)

  name group    skills
0   张三   DBA     Linux
1   张三   DBA       数据库
2   李四    PM  Axuer RP
3   李四    PM        社交
4   王五    PM  Axuer RP
5   王五    PM        社交
6   赵六    HR        招聘
7   赵六    HR        组织

两个表没有同名列时，如何合并
---

两个对象没有同名列时，用left_on和right_on强制指定列名对应合并

In [50]:
# df1，姓名 name 和分组
df1

  name group
0   张三   DBA
1   李四    PM
2   王五    PM
3   赵六    HR

In [51]:
# df6，姓名2 username 和薪资
df6 = pd.DataFrame({
    'username': ['王五', '张三', '赵六', '李四'],
    'salary': [10000, 160000, 7000, 120000]
})
df6

  username  salary
0       王五   10000
1       张三  160000
2       赵六    7000
3       李四  120000

In [52]:
pd.merge(df1, df6, left_on='name', right_on='username')

  name group username  salary
0   张三   DBA       张三  160000
1   李四    PM       李四  120000
2   王五    PM       王五   10000
3   赵六    HR       赵六    7000

In [54]:
pd.merge(df1, df6, left_on='name', right_on='username').drop('username', axis=1)  # 删除重复列

  name group  salary
0   张三   DBA  160000
1   李四    PM  120000
2   王五    PM   10000
3   赵六    HR    7000

按照行索引合并
---

当要合并数据的行索引相关时，指定 merge() 函数的参数 left_index 与 right_index 的值为 True，就可以实现自动依照索引序号合并

join()函数也能实现，写法更简单

merge()的优势在于更灵活，尤其是当数据集索引值差别很大，数据合并又必须以其中一组数据的索引值为依据时

In [61]:
# df1a，将df1的name列设为行索引
df1a = df1.set_index('name')
df1a

     group
name
张三     DBA
李四      PM
王五      PM
赵六      HR

In [62]:
# df2a，将df2的name列设为行索引
df2a = df2.set_index('name')
df2a

      date
name
李四    2004
赵六    2008
张三    2012
王五    2014

按索引合并，最简单的方式 ：join()

In [66]:
df1a.join(df2a)
df1a.join(df2a).reset_index()
pd.merge(df1a, df2a, left_index=True, right_index=True)  # merge实现，同上

     group  date
name
张三     DBA  2012
李四      PM  2004
王五      PM  2014
赵六      HR  2008

两数据索引差异巨大，又必须以一个索引为主合并

In [67]:
# df1a，姓名和分组，姓名为行索引
df1a

     group
name
张三     DBA
李四      PM
王五      PM
赵六      HR

In [68]:
# df6，姓名2和薪资
df6

  username  salary
0       王五   10000
1       张三  160000
2       赵六    7000
3       李四  120000

In [70]:
# 指定一个表的行索引和另一个表的列为基准合并
pd.merge(df1a, df6, left_index=True, right_on='username')

  group username  salary
1   DBA       张三  160000
3    PM       李四  120000
0    PM       王五   10000
2    HR       赵六    7000

两个对应列不完全重复的数据集的合并
---

参数 how

* `how='inner'`，交集，两个表共有的行
* `how='outer'`，并集，两个表所有的行
* `how='left'`，表1的行
* `how='right'`，表2的行

In [71]:
# df1，姓名和分组
df1

  name group
0   张三   DBA
1   李四    PM
2   王五    PM
3   赵六    HR

In [72]:
# df7，姓名和时间，姓名列不完全一致
df7 = pd.DataFrame({'name':['张一', '李二', '赵六'], 'data':[2000,2001,2002]})
df7

  name  data
0   张一  2000
1   李二  2001
2   赵六  2002

In [75]:
pd.merge(df1, df7)
pd.merge(df1, df7, how='inner')  # 默认，交集

  name group  data
0   赵六    HR  2002

In [76]:
pd.merge(df1, df7, how='outer')  # 并集

  name group    data
0   张三   DBA     NaN
1   李四    PM     NaN
2   王五    PM     NaN
3   赵六    HR  2002.0
4   张一   NaN  2000.0
5   李二   NaN  2001.0

In [77]:
pd.merge(df1, df7, how='left')  # 以左表为基准

  name group    data
0   张三   DBA     NaN
1   李四    PM     NaN
2   王五    PM     NaN
3   赵六    HR  2002.0

In [78]:
pd.merge(df1, df7, how='right')  # 以右表为基准

  name group  data
0   赵六    HR  2002
1   张一   NaN  2000
2   李二   NaN  2001

合并数据集中包含两个或以上相同列名时
---

参数 on 指定用于合并的主键

合并后的数据集中，之前相同的列名会被默认加上 _x 等后缀用于区分

参数 suffixes 可以自定义后缀

In [79]:
# df1，姓名和分组
df1

  name group
0   张三   DBA
1   李四    PM
2   王五    PM
3   赵六    HR

In [80]:
# df8，相同的姓名和分组
df8 = pd.DataFrame({
    'name': ['张三', '王五', '赵六', '李四'],
    'group': ['code', 'VP','VP', 'code']
})
df8

  name group
0   张三  code
1   王五    VP
2   赵六    VP
3   李四  code

In [83]:
pd.merge(df1, df8, on='name')

  name group_x group_y
0   张三     DBA    code
1   李四      PM    code
2   王五      PM      VP
3   赵六      HR      VP

In [84]:
# 通过设置参数 suffixes 自定义后缀
pd.merge(df1, df8, on='name', suffixes=['_L', '_R'])

  name group_L group_R
0   张三     DBA    code
1   李四      PM    code
2   王五      PM      VP
3   赵六      HR      VP

合并重叠数据（了解）
---

有一类数据组合问题不能用简单的合并（merge）或连接（concatenation(concat)）运算来处理。 如合并全部或部分重叠的两个数据集

举例，我们使用NumPy的where函数，它表示一种等价于面向数组的if-else

#### 以a为基准合并，a的缺失值使用b填充

先给a打补丁（用b填充a的缺失值，再合并）

In [85]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series(np.arange(len(a), dtype=np.float64), index=['f', 'e', 'd', 'c', 'b', 'a'])
b[-1] = np.nan

In [86]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [87]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [92]:
ax = a.copy()
ax.isnull()
ax[ax.isnull()]  # 查询a的缺失值

ax[ax.isnull()] = b  # a的缺失值用b填充（操作默认是索引对齐）
ax

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    NaN
dtype: float64

Series有一个combine_first方法，实现的也是类似功能，

除了用b填充a的缺失值，还带有pandas数据对齐的合并功能

#### 例子：以a2为基准合并，a2缺失数据使用b2填充

In [93]:
a2 = a[2:].copy()
a2

d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [94]:
b2 = b[:-2].copy()
b2

f    0.0
e    1.0
d    2.0
c    3.0
dtype: float64

方法1：使用原生方式打补丁(a2的缺失值使用b2填充)

In [96]:
# 1:使用b2填充a2的缺失值(打补丁)
a2[a2.isnull()] = b2
a2

d    2.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [97]:
# 2：合并数据
a22 = a2.append(b2)
a22

d    2.0
c    3.5
b    4.5
a    NaN
f    0.0
e    1.0
d    2.0
c    3.0
dtype: float64

In [102]:
# 3：去重，排序
a22.index.duplicated()
a22[~(a22.index.duplicated())].sort_index()

a    NaN
b    4.5
c    3.5
d    2.0
e    1.0
f    0.0
dtype: float64

方法2：使用combine_first方法，先打补丁，再合并，再去重排序

In [103]:
a3 = a[2:].copy()
a3

d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [105]:
a3.combine_first(b2)

a    NaN
b    4.5
c    3.5
d    2.0
e    1.0
f    0.0
dtype: float64

对于DataFrame，combine_first会在列上应用同样操作，可以将其看做：

    用传递对象中的数据为调用对象的缺失数据“打补丁”

In [106]:
df11 = pd.DataFrame({'a': [1., np.nan, 5., np.nan], 'b': [np.nan, 2., np.nan, 6.], 'c': range(2, 18, 4)})
df21 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.], 'b': [np.nan, 3., 4., 6., 8.]})

In [107]:
df11

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [108]:
df21

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [109]:
df11.combine_first(df21)  # 以df11为基准，先填充缺失值（用df21的值填充df11），再合并(df21的多余行列合并到df11上)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [110]:
df21.combine_first(df11)  # 以df21为基准，先填充（用df11的值填充df21），再合并

     a    b     c
0  5.0  NaN   2.0
1  4.0  3.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN